enthalpyBased_tou0.00001_frictionFactor0.005_NSCBC/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.air 0.5
    
    volScalarFieldValue T.air 274.69
    volScalarFieldValue T.water 274.69
    volScalarFieldValue p 3623237.0168
);

regions
(
    boxToCell
    {
        box (256 -1 -1) (257 1 1);
        fieldValues
        (
            volScalarFieldValue alpha.air 0.99 volScalarFieldValue T.air 240 volScalarFieldValue T.water 240 volScalarFieldValue p 1282500
        );
    }
);


// ************************************************************************* //
